{"_id":{"$oid":"62e940071313799175eb09cc"},"Title":"Hot Rod","Description":"The film stars Andy Samberg as amateur stuntman Rod Kimble, whose stepfather, Frank (Ian McShane), continuously mocks and disrespects him. When Frank becomes ill, Rod raises money for his heart operation by executing his largest stunt yet.","Genre":{"Name":"Action/Comedy","Description":"A film or television programme which blends comedy with a lively plot and fast-paced action."},"Director":{"Name":"Akiva Schaffer","Bio":"Akiva Schaffer was born on December 1, 1977 in Berkeley, California, USA. He is a writer and director, known for Popstar: Never Stop Never Stopping (2016), Saturday Night Live (1975) and The Lego Movie (2014). He has been married to Liz Cackowski since 2010. They have two children."},"ImagePath":"hotrod.jpg","Featured":true}
{"_id":{"$oid":"62e947861313799175eb09cd"},"Title":"The Big Year","Description":"Two bird enthusiasts try to defeat the cocky, cutthroat world record holder in a year-long bird-spotting competition that leads to adventure, friendship and hijinx!","Genre":{"Name":"Comedy","Description":"Comedies are light-hearted dramas, crafted to amuse, entertain, and provoke enjoyment."},"Director":{"Name":"David Frankel","Bio":"David Frankel is a production manager and producer, known for The Devil Wears Prada (2006), One Chance (2013) and Band of Brothers (2001)."},"ImagePath":"thebigyear.jpeg","Featured":false}
{"_id":{"$oid":"62e949c91313799175eb09ce"},"Title":"Forgetting Sarah Marshall","Description":"Peter (Jason Segel) is a struggling musician who finds his world turned upside down when his TV celebrity girlfriend, Sarah Marshall (Kristen Bell), dumps him for a tragically hip rock star. It's the hysterically funny look at how far one man will go to forget a girl – and all the fun he finds along the way!","Genre":{"Name":"Comedy","Description":"Comedies are light-hearted dramas, crafted to amuse, entertain, and provoke enjoyment."},"Director":{"Name":"Nicholas Stoller","Bio":"Nicholas Stoller is an English-American screenwriter and director. He is known best for directing the 2008 comedy Forgetting Sarah Marshall, and writing/directing its 2010 spin-off/sequel, Get Him to the Greek. He also wrote The Muppets and directed the Seth Rogen comedy, Neighbors. He is a frequent creative partner of Jason Segel."},"ImagePath":"sarhmarshall.jpg","Featured":false}
{"_id":{"$oid":"62e94ab11313799175eb09cf"},"Title":"Harry Potter and the Prisoner of Azkaban","Description":"The movie follows Harry Potter, a young wizard, in his third year at Hogwarts School of Witchcraft and Wizardry. Along with friends Ronald Weasley and Hermione Granger, Harry investigates Sirius Black, an escaped prisoner from Azkaban, the wizard prison, believed to be one of Lord Voldemort's old allies.","Genre":{"Name":"Fantasy/Adventure","Description":"A type of adventure film where the action takes place in imaginary lands with strange beasts, wizards and witches."},"Director":{"Name":"Alfonso Cuaron","Bio":"Alfonso Cuaron is known for directing films in a variety of genres including the family drama A Little Princess (1995), the romantic drama Great Expectations (1998), the coming of age road film Y tu mamá también (2001), the fantasy film Harry Potter and the Prisoner of Azkaban (2004), and the science fiction films Children of Men (2006) and Gravity (2013), and the semi-autobiographical drama Roma (2018), as well as the 2009 short I Am Autism."},"ImagePath":"harrypotter.jpeg","Featured":false}
{"_id":{"$oid":"62e94b551313799175eb09d0"},"Title":"The Hobbit: An Unexpected Journey","Description":"An Unexpected Journey tells the tale of Bilbo Baggins who is convinced by the wizard Gandalf to accompany thirteen Dwarves, led by Thorin Oakenshield on a quest to reclaim the Lonely Mountain from the dragon Smaug.","Genre":{"Name":"Fantasy/Adventure","Description":"A type of adventure film where the action takes place in imaginary lands with strange beasts, wizards and witches."},"Director":{"Name":"Peter Jackson","Bio":"Sir Peter Robert Jackson is a New Zealand film director, screenwriter and producer. He is best known as the director, writer and producer of the Lord of the Rings trilogy (2001–2003) and the Hobbit trilogy (2012–2014), both of which are adapted from the novels of the same name by J. R. R. Tolkien."},"ImagePath":"thehobbit.jpeg","Featured":false}
{"_id":{"$oid":"62e94bf01313799175eb09d2"},"Title":"Moulin Rouge!","Description":"Moulin Rouge!is a 2001 jukebox musical romantic drama film directed, co-produced, and co-written by Baz Luhrmann. It follows a young English poet, Christian, who falls in love with the star of the Moulin Rouge, cabaret actress and courtesan Satine.","Genre":{"Name":"Musical/Romance","Description":"A type of romance that features music, singing, and dance."},"Director":{"Name":"Baz Luhrmann","Bio":"Mark Anthony Luhrmann (born 17 September 1962) is an Australian filmmaker and actor with projects spanning film, television, opera, theatre, music and recording industries."},"ImagePath":"moulinrouge.jpeg","Featured":false}
{"_id":{"$oid":"62e94ca01313799175eb09d3"},"Title":"The Secret Life of Walter Mitty","Description":"When both he and a colleague are about to lose their job, Walter takes action by embarking on an adventure more extraordinary than anything he ever imagined.","Genre":{"Name":"Comedy/Adventure","Description":"A hybrid of the adventure and comedy genres, blending action, suspense, exotic locales and the heroic journey of the adventure genre with comedic elements."},"Director":{"Name":"Ben Stiller","Bio":"Benjamin Edward Meara Stiller is an American actor, comedian, producer, director, and screenwriter. He is well known for his over-the-top comedy in many of his films."},"ImagePath":"waltermitty.jpg","Featured":false}
{"_id":{"$oid":"62e94d3f1313799175eb09d4"},"Title":"Get Smart","Description":"Maxwell Smart, a highly intellectual but bumbling spy working for the CONTROL agency, is tasked with preventing a terrorist attack from rival spy agency KAOS.","Genre":{"Name":"Action/Comedy","Description":"A film or television programme which blends comedy with a lively plot and fast-paced action."},"Director":{"Name":"Peter Segal","Bio":"Peter Segal is an American film director, producer, screenwriter, and actor. Segal has directed the comedic films Tommy Boy (1995), 50 First Dates (2004), The Longest Yard (2005), and Get Smart (2008)."},"ImagePath":"getsmart.jpeg","Featured":false}
{"_id":{"$oid":"62e94db41313799175eb09d5"},"Title":"About Time","Description":"At the age of 21, Tim discovers he can travel in time and change what happens and has happened in his own life. His decision to make his world a better place by getting a girlfriend turns out not to be as easy as you might think.","Genre":{"Name":"Fantasy/Romance","Description":"As a genre, fantasy romance focuses on the love story, while other fantasy fiction may have a love story as a subplot."},"Director":{"Name":"Richard Curtis","Bio":"Richard Curtis is a writer and producer, known for Love Actually (2003), Four Weddings and a Funeral (1994) and About Time (2013)."},"ImagePath":"abouttime.jpeg","Featured":false}
{"_id":{"$oid":"62e94e1f1313799175eb09d6"},"Title":"Zoolander","Description":"At the end of his career, a clueless fashion model is brainwashed to kill the Prime Minister of Malaysia.","Genre":{"Name":"Action/Comedy","Description":"A film or television programme which blends comedy with a lively plot and fast-paced action."},"Director":{"Name":"Ben Stiller","Bio":"Benjamin Edward Meara Stiller is an American actor, comedian, producer, director, and screenwriter. He is well known for his over-the-top comedy in many of his films."},"ImagePath":"zoolander.jpeg","Featured":false}
